src/Documents/ВводПроизвольныхНачислений/ВводПроизвольныхНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводПроизвольныхНачислений</name>
  <registerRecords>CalculationRegister.ЖурналНачислений</registerRecords>
  <registerRecords>CalculationRegister.ДопНачисления</registerRecords>
  <tabularSections>
    <name>ЖурналНачислений</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодДействияНачало</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодДействияКонец</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодНачало</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодКонец</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>График</name>
      <type>
        <types>CatalogRef.ГрафикиРаботы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДопНачисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ДопНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодНачало</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодКонец</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ВводПроизвольныхНачислений/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	

	Для каждого Стр Из ЖурналНачислений Цикл
		Запись = Движения.ЖурналНачислений.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Стр);
		Запись.ПериодРегистрации = Дата;
		Запись.ПериодДействияКонец = КонецДня(Запись.ПериодДействияКонец); 
	КонецЦикла; 
	
	Для каждого Стр Из ДопНачисления Цикл
		Запись = Движения.ДопНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Стр);
		Запись.ПериодРегистрации = Дата;
	КонецЦикла; 
	
	ЗаписиСторно = Движения.ЖурналНачислений.ПолучитьДополнение();
	Для каждого Стр Из ЗаписиСторно Цикл
		Запись = Движения.ЖурналНачислений.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Стр);
		Запись.ПериодРегистрации = Стр.ПериодРегистрацииСторно;
		Запись.ПериодДействияНачало = Стр.ПериодДействияНачалоСторно; 
		Запись.ПериодДействияКонец = КонецДня(Стр.ПериодДействияКонецСторно); 
		Запись.Сторно = Истина;
	КонецЦикла; 
	
	//Движения.ЖурналНачислений.Записывать = Истина;
	
	Движения.ЖурналНачислений.Записать(,,,ЛОЖЬ);
	Движения.ДопНачисления.Записать(,,,ЛОЖЬ);

	Расчет.РассчитатьЗаписи(Ссылка, НачалоМесяца(Дата) );
	
КонецПроцедуры
